fduignan/stm32f334/include/STM32F3x4.h

/****************************************************************************************************//**
 * @file     STM32F3x4.h
 *
 * @brief    CMSIS Cortex-M4 Peripheral Access Layer Header File for
 *           STM32F3x4 from <unknown Vendor>.
 *
 * @version  V1.4
 * @date     23. January 2019
 *
 * @note     Generated with SVDConv V2.75 
 *           from CMSIS SVD File 'STM32F3x4.svd' Version 1.4,
 *******************************************************************************************************/



/** @addtogroup (null)
  * @{
  */

/** @addtogroup STM32F3x4
  * @{
  */

#ifndef STM32F3X4_H
#define STM32F3X4_H

#ifdef __cplusplus
extern "C" {
#endif


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -------------------  Cortex-M4 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NonMaskableInt_IRQn           = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  MemoryManagement_IRQn         = -12,              /*!<   4  Memory Management, MPU mismatch, including Access Violation
                                                         and No Match                                                          */
  BusFault_IRQn                 = -11,              /*!<   5  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                         related Fault                                                         */
  UsageFault_IRQn               = -10,              /*!<   6  Usage Fault, i.e. Undef Instruction, Illegal State Transition    */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */
  DebugMonitor_IRQn             =  -4,              /*!<  12  Debug Monitor                                                    */
  PendSV_IRQn                   =  -2,              /*!<  14  Pendable request for system service                              */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* --------------------  STM32F3x4 Specific Interrupt Numbers  -------------------- */
  WWDG_IRQn                     =   0,              /*!<   0  Window Watchdog interrupt                                        */
  PVD_IRQn                      =   1,              /*!<   1  PVD through EXTI line detection interrupt                        */
  TAMP_STAMP_IRQn               =   2,              /*!<   2  Tamper and TimeStamp interrupts                                  */
  RTC_WKUP_IRQn                 =   3,              /*!<   3  RTC Wakeup interrupt through the EXTI line                       */
  FLASH_IRQn                    =   4,              /*!<   4  Flash global interrupt                                           */
  RCC_IRQn                      =   5,              /*!<   5  RCC global interrupt                                             */
  EXTI0_IRQn                    =   6,              /*!<   6  EXTI Line0 interrupt                                             */
  EXTI1_IRQn                    =   7,              /*!<   7  EXTI Line3 interrupt                                             */
  EXTI2_TSC_IRQn                =   8,              /*!<   8  EXTI Line2 and Touch sensing interrupts                          */
  EXTI3_IRQn                    =   9,              /*!<   9  EXTI Line3 interrupt                                             */
  EXTI4_IRQn                    =  10,              /*!<  10  EXTI Line4 interrupt                                             */
  DMA1_CH1_IRQn                 =  11,              /*!<  11  DMA1 channel 1 interrupt                                         */
  DMA1_CH2_IRQn                 =  12,              /*!<  12  DMA1 channel 2 interrupt                                         */
  DMA1_CH3_IRQn                 =  13,              /*!<  13  DMA1 channel 3 interrupt                                         */
  DMA1_CH4_IRQn                 =  14,              /*!<  14  DMA1 channel 4 interrupt                                         */
  DMA1_CH5_IRQn                 =  15,              /*!<  15  DMA1 channel 5 interrupt                                         */
  DMA1_CH6_IRQn                 =  16,              /*!<  16  DMA1 channel 6 interrupt                                         */
  DMA1_CH7_IRQn                 =  17,              /*!<  17  DMA1 channel 7interrupt                                          */
  ADC1_2_IRQn                   =  18,              /*!<  18  ADC1 and ADC2 global interrupt                                   */
  USB_HP_CAN_TX_IRQn            =  19,              /*!<  19  USB High Priority/CAN_TX interrupts                              */
  USB_LP_CAN_RX0_IRQn           =  20,              /*!<  20  USB Low Priority/CAN_RX0 interrupts                              */
  CAN_RX1_IRQn                  =  21,              /*!<  21  CAN_RX1 interrupt                                                */
  CAN_SCE_IRQn                  =  22,              /*!<  22  CAN_SCE interrupt                                                */
  EXTI9_5_IRQn                  =  23,              /*!<  23  EXTI Line5 to Line9 interrupts                                   */
  TIM1_BRK_TIM15_IRQn           =  24,              /*!<  24  TIM1 Break/TIM15 global interruts                                */
  TIM1_UP_TIM16_IRQn            =  25,              /*!<  25  TIM1 Update/TIM16 global interrupts                              */
  TIM1_TRG_COM_TIM17_IRQn       =  26,              /*!<  26  TIM1 trigger and commutation/TIM17 interrupts                    */
  TIM1_CC_IRQn                  =  27,              /*!<  27  TIM1 capture compare interrupt                                   */
  TIM2_IRQn                     =  28,              /*!<  28  TIM2 global interrupt                                            */
  TIM3_IRQ_IRQn                 =  29,              /*!<  29  Timer 3 global interrupt                                         */
  I2C1_EV_EXTI23_IRQn           =  31,              /*!<  31  I2C1 event interrupt and EXTI Line23 interrupt                   */
  I2C1_ER_IRQn                  =  32,              /*!<  32  I2C1 error interrupt                                             */
  SPI1_IRQn                     =  35,              /*!<  35  SPI1 global interrupt                                            */
  USART1_EXTI25_IRQn            =  37,              /*!<  37  USART1 global interrupt and EXTI Line 25 interrupt               */
  USART2_EXTI26_IRQn            =  38,              /*!<  38  USART2 global interrupt and EXTI Line 26 interrupt               */
  USART3_EXTI28_IRQn            =  39,              /*!<  39  USART3 global interrupt and EXTI Line 28 interrupt               */
  EXTI15_10_IRQn                =  40,              /*!<  40  EXTI Line15 to Line10 interrupts                                 */
  RTCAlarm_IRQn                 =  41,              /*!<  41  RTC alarm interrupt                                              */
  TIM6_DAC1_IRQn                =  54,              /*!<  54  TIM6 global and DAC12 underrun interrupts                        */
  TIM7_DAC2_IRQn                =  55,              /*!<  55  TIM7 global interrupt                                            */
  FPU_IRQn                      =  81,              /*!<  81  Floating point unit interrupt                                    */
  HRTIM1_MST_IRQn               = 103,              /*!< 103  HRTIM1 master timer interrupt                                    */
  HRTIM1_TIMA_IRQn              = 104,              /*!< 104  HRTIM1 timer A interrupt                                         */
  HRTIM_TIMB_IRQn               = 105,              /*!< 105  HRTIM1 timer B interrupt                                         */
  HRTIM1_TIMC_IRQn              = 106,              /*!< 106  HRTIM1 timer C interrupt                                         */
  HRTIM1_TIMD_IRQn              = 107,              /*!< 107  HRTIM1 timer D interrupt                                         */
  HRTIM_TIME_IRQn               = 108,              /*!< 108  HRTIM1 timer E interrupt                                         */
  HRTIM1_FLT_IRQn               = 109               /*!< 109  HRTIM1 fault interrupt                                           */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the Cortex-M4 Processor and Core Peripherals---------------- */
#define __CM4_REV                 0x0100            /*!< Cortex-M4 Core Revision                                               */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               3            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
#define __FPU_PRESENT                  0            /*!< FPU present or not                                                    */
/** @} */ /* End of group Configuration_of_CMSIS */

#include <core_cm4.h>                               /*!< Cortex-M4 processor and core peripherals                              */
#include "system_STM32F3x4.h"                       /*!< STM32F3x4 System                                                      */


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================                      GPIOA                     ================ */
/* ================================================================================ */


/**
  * @brief General-purpose I/Os (GPIOA)
  */

typedef struct {                                    /*!< GPIOA Structure                                                       */
  __IO uint32_t  MODER;                             /*!< GPIO port mode register                                               */
  __IO uint32_t  OTYPER;                            /*!< GPIO port output type register                                        */
  __IO uint32_t  OSPEEDR;                           /*!< GPIO port output speed register                                       */
  __IO uint32_t  PUPDR;                             /*!< GPIO port pull-up/pull-down register                                  */
  __I  uint32_t  IDR;                               /*!< GPIO port input data register                                         */
  __IO uint32_t  ODR;                               /*!< GPIO port output data register                                        */
  __O  uint32_t  BSRR;                              /*!< GPIO port bit set/reset register                                      */
  __IO uint32_t  LCKR;                              /*!< GPIO port configuration lock register                                 */
  __IO uint32_t  AFRL;                              /*!< GPIO alternate function low register                                  */
  __IO uint32_t  AFRH;                              /*!< GPIO alternate function high register                                 */
  __O  uint32_t  BRR;                               /*!< Port bit reset register                                               */
} GPIOA_Type;


/* ================================================================================ */
/* ================                      GPIOB                     ================ */
/* ================================================================================ */


/**
  * @brief General-purpose I/Os (GPIOB)
  */

typedef struct {                                    /*!< GPIOB Structure                                                       */
  __IO uint32_t  MODER;                             /*!< GPIO port mode register                                               */
  __IO uint32_t  OTYPER;                            /*!< GPIO port output type register                                        */
  __IO uint32_t  OSPEEDR;                           /*!< GPIO port output speed register                                       */
  __IO uint32_t  PUPDR;                             /*!< GPIO port pull-up/pull-down register                                  */
  __I  uint32_t  IDR;                               /*!< GPIO port input data register                                         */
  __IO uint32_t  ODR;                               /*!< GPIO port output data register                                        */
  __O  uint32_t  BSRR;                              /*!< GPIO port bit set/reset register                                      */
  __IO uint32_t  LCKR;                              /*!< GPIO port configuration lock register                                 */
  __IO uint32_t  AFRL;                              /*!< GPIO alternate function low register                                  */
  __IO uint32_t  AFRH;                              /*!< GPIO alternate function high register                                 */
  __O  uint32_t  BRR;                               /*!< Port bit reset register                                               */
} GPIOB_Type;


/* ================================================================================ */
/* ================                      GPIOC                     ================ */
/* ================================================================================ */


/**
  * @brief General-purpose I/Os (GPIOC)
  */

typedef struct {                                    /*!< GPIOC Structure                                                       */
  __IO uint32_t  MODER;                             /*!< GPIO port mode register                                               */
  __IO uint32_t  OTYPER;                            /*!< GPIO port output type register                                        */
  __IO uint32_t  OSPEEDR;                           /*!< GPIO port output speed register                                       */
  __IO uint32_t  PUPDR;                             /*!< GPIO port pull-up/pull-down register                                  */
  __I  uint32_t  IDR;                               /*!< GPIO port input data register                                         */
  __IO uint32_t  ODR;                               /*!< GPIO port output data register                                        */
  __O  uint32_t  BSRR;                              /*!< GPIO port bit set/reset register                                      */
  __IO uint32_t  LCKR;                              /*!< GPIO port configuration lock register                                 */
  __IO uint32_t  AFRL;                              /*!< GPIO alternate function low register                                  */
  __IO uint32_t  AFRH;                              /*!< GPIO alternate function high register                                 */
  __O  uint32_t  BRR;                               /*!< Port bit reset register                                               */
} GPIOC_Type;


/* ================================================================================ */
/* ================                       TSC                      ================ */
/* ================================================================================ */


/**
  * @brief Touch sensing controller (TSC)
  */

