fduignan/stm32f334/include/STM32F3x4.h
typedef struct {                                    /*!< TSC Structure                                                         */
  __IO uint32_t  CR;                                /*!< control register                                                      */
  __IO uint32_t  IER;                               /*!< interrupt enable register                                             */
  __IO uint32_t  ICR;                               /*!< interrupt clear register                                              */
  __IO uint32_t  ISR;                               /*!< interrupt status register                                             */
  __IO uint32_t  IOHCR;                             /*!< I/O hysteresis control register                                       */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  IOASCR;                            /*!< I/O analog switch control register                                    */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  IOSCR;                             /*!< I/O sampling control register                                         */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  IOCCR;                             /*!< I/O channel control register                                          */
  __I  uint32_t  RESERVED3;
  __IO uint32_t  IOGCSR;                            /*!< I/O group control status register                                     */
  __I  uint32_t  IOG1CR;                            /*!< I/O group x counter register                                          */
  __I  uint32_t  IOG2CR;                            /*!< I/O group x counter register                                          */
  __I  uint32_t  IOG3CR;                            /*!< I/O group x counter register                                          */
  __I  uint32_t  IOG4CR;                            /*!< I/O group x counter register                                          */
  __I  uint32_t  IOG5CR;                            /*!< I/O group x counter register                                          */
  __I  uint32_t  IOG6CR;                            /*!< I/O group x counter register                                          */
  __I  uint32_t  IOG7CR;                            /*!< I/O group x counter register                                          */
  __I  uint32_t  IOG8CR;                            /*!< I/O group x counter register                                          */
} TSC_Type;


/* ================================================================================ */
/* ================                       CRC                      ================ */
/* ================================================================================ */


/**
  * @brief cyclic redundancy check calculation unit (CRC)
  */

typedef struct {                                    /*!< CRC Structure                                                         */
  __IO uint32_t  DR;                                /*!< Data register                                                         */
  __IO uint32_t  IDR;                               /*!< Independent data register                                             */
  __IO uint32_t  CR;                                /*!< Control register                                                      */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  INIT;                              /*!< Initial CRC value                                                     */
  __IO uint32_t  POL;                               /*!< CRC polynomial                                                        */
} CRC_Type;


/* ================================================================================ */
/* ================                      Flash                     ================ */
/* ================================================================================ */


/**
  * @brief Flash (Flash)
  */

typedef struct {                                    /*!< Flash Structure                                                       */
  __IO uint32_t  ACR;                               /*!< Flash access control register                                         */
  __O  uint32_t  KEYR;                              /*!< Flash key register                                                    */
  __O  uint32_t  OPTKEYR;                           /*!< Flash option key register                                             */
  __IO uint32_t  SR;                                /*!< Flash status register                                                 */
  __IO uint32_t  CR;                                /*!< Flash control register                                                */
  __O  uint32_t  AR;                                /*!< Flash address register                                                */
  __I  uint32_t  RESERVED0;
  __I  uint32_t  OBR;                               /*!< Option byte register                                                  */
  __I  uint32_t  WRPR;                              /*!< Write protection register                                             */
} Flash_Type;


/* ================================================================================ */
/* ================                       RCC                      ================ */
/* ================================================================================ */


/**
  * @brief Reset and clock control (RCC)
  */

typedef struct {                                    /*!< RCC Structure                                                         */
  __IO uint32_t  CR;                                /*!< Clock control register                                                */
  __IO uint32_t  CFGR;                              /*!< Clock configuration register (RCC_CFGR)                               */
  __IO uint32_t  CIR;                               /*!< Clock interrupt register (RCC_CIR)                                    */
  __IO uint32_t  APB2RSTR;                          /*!< APB2 peripheral reset register (RCC_APB2RSTR)                         */
  __IO uint32_t  APB1RSTR;                          /*!< APB1 peripheral reset register (RCC_APB1RSTR)                         */
  __IO uint32_t  AHBENR;                            /*!< AHB Peripheral Clock enable register (RCC_AHBENR)                     */
  __IO uint32_t  APB2ENR;                           /*!< APB2 peripheral clock enable register (RCC_APB2ENR)                   */
  __IO uint32_t  APB1ENR;                           /*!< APB1 peripheral clock enable register (RCC_APB1ENR)                   */
  __IO uint32_t  BDCR;                              /*!< Backup domain control register (RCC_BDCR)                             */
  __IO uint32_t  CSR;                               /*!< Control/status register (RCC_CSR)                                     */
  __IO uint32_t  AHBRSTR;                           /*!< AHB peripheral reset register                                         */
  __IO uint32_t  CFGR2;                             /*!< Clock configuration register 2                                        */
  __IO uint32_t  CFGR3;                             /*!< Clock configuration register 3                                        */
} RCC_Type;


/* ================================================================================ */
/* ================                      DMA1                      ================ */
/* ================================================================================ */


/**
  * @brief DMA controller 1 (DMA1)
  */

