fduignan/stm32f334/include/STM32F3x4.h
typedef struct {                                    /*!< DMA1 Structure                                                        */
  __I  uint32_t  ISR;                               /*!< DMA interrupt status register (DMA_ISR)                               */
  __O  uint32_t  IFCR;                              /*!< DMA interrupt flag clear register (DMA_IFCR)                          */
  __IO uint32_t  CCR1;                              /*!< DMA channel configuration register (DMA_CCR)                          */
  __IO uint32_t  CNDTR1;                            /*!< DMA channel 1 number of data register                                 */
  __IO uint32_t  CPAR1;                             /*!< DMA channel 1 peripheral address register                             */
  __IO uint32_t  CMAR1;                             /*!< DMA channel 1 memory address register                                 */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  CCR2;                              /*!< DMA channel configuration register (DMA_CCR)                          */
  __IO uint32_t  CNDTR2;                            /*!< DMA channel 2 number of data register                                 */
  __IO uint32_t  CPAR2;                             /*!< DMA channel 2 peripheral address register                             */
  __IO uint32_t  CMAR2;                             /*!< DMA channel 2 memory address register                                 */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  CCR3;                              /*!< DMA channel configuration register (DMA_CCR)                          */
  __IO uint32_t  CNDTR3;                            /*!< DMA channel 3 number of data register                                 */
  __IO uint32_t  CPAR3;                             /*!< DMA channel 3 peripheral address register                             */
  __IO uint32_t  CMAR3;                             /*!< DMA channel 3 memory address register                                 */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  CCR4;                              /*!< DMA channel configuration register (DMA_CCR)                          */
  __IO uint32_t  CNDTR4;                            /*!< DMA channel 4 number of data register                                 */
  __IO uint32_t  CPAR4;                             /*!< DMA channel 4 peripheral address register                             */
  __IO uint32_t  CMAR4;                             /*!< DMA channel 4 memory address register                                 */
  __I  uint32_t  RESERVED3;
  __IO uint32_t  CCR5;                              /*!< DMA channel configuration register (DMA_CCR)                          */
  __IO uint32_t  CNDTR5;                            /*!< DMA channel 5 number of data register                                 */
  __IO uint32_t  CPAR5;                             /*!< DMA channel 5 peripheral address register                             */
  __IO uint32_t  CMAR5;                             /*!< DMA channel 5 memory address register                                 */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  CCR6;                              /*!< DMA channel configuration register (DMA_CCR)                          */
  __IO uint32_t  CNDTR6;                            /*!< DMA channel 6 number of data register                                 */
  __IO uint32_t  CPAR6;                             /*!< DMA channel 6 peripheral address register                             */
  __IO uint32_t  CMAR6;                             /*!< DMA channel 6 memory address register                                 */
  __I  uint32_t  RESERVED5;
  __IO uint32_t  CCR7;                              /*!< DMA channel configuration register (DMA_CCR)                          */
  __IO uint32_t  CNDTR7;                            /*!< DMA channel 7 number of data register                                 */
  __IO uint32_t  CPAR7;                             /*!< DMA channel 7 peripheral address register                             */
  __IO uint32_t  CMAR7;                             /*!< DMA channel 7 memory address register                                 */
} DMA1_Type;


/* ================================================================================ */
/* ================                      TIM2                      ================ */
/* ================================================================================ */


/**
  * @brief General purpose timer (TIM2)
  */

typedef struct {                                    /*!< TIM2 Structure                                                        */
  __IO uint32_t  CR1;                               /*!< control register 1                                                    */
  __IO uint32_t  CR2;                               /*!< control register 2                                                    */
  __IO uint32_t  SMCR;                              /*!< slave mode control register                                           */
  __IO uint32_t  DIER;                              /*!< DMA/Interrupt enable register                                         */
  __IO uint32_t  SR;                                /*!< status register                                                       */
  __O  uint32_t  EGR;                               /*!< event generation register                                             */
  
  union {
    __IO uint32_t  CCMR1_Input;                     /*!< capture/compare mode register 1 (input mode)                          */
    __IO uint32_t  CCMR1_Output;                    /*!< capture/compare mode register 1 (output mode)                         */
  } ;
  
  union {
    __IO uint32_t  CCMR2_Input;                     /*!< capture/compare mode register 2 (input mode)                          */
    __IO uint32_t  CCMR2_Output;                    /*!< capture/compare mode register 2 (output mode)                         */
  } ;
  __IO uint32_t  CCER;                              /*!< capture/compare enable register                                       */
  __IO uint32_t  CNT;                               /*!< counter                                                               */
  __IO uint32_t  PSC;                               /*!< prescaler                                                             */
  __IO uint32_t  ARR;                               /*!< auto-reload register                                                  */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  CCR1;                              /*!< capture/compare register 1                                            */
  __IO uint32_t  CCR2;                              /*!< capture/compare register 2                                            */
  __IO uint32_t  CCR3;                              /*!< capture/compare register 3                                            */
  __IO uint32_t  CCR4;                              /*!< capture/compare register 4                                            */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  DCR;                               /*!< DMA control register                                                  */
  __IO uint32_t  DMAR;                              /*!< DMA address for full transfer                                         */
} TIM2_Type;


/* ================================================================================ */
/* ================                      TIM15                     ================ */
/* ================================================================================ */


/**
  * @brief General purpose timers (TIM15)
  */

typedef struct {                                    /*!< TIM15 Structure                                                       */
  __IO uint32_t  CR1;                               /*!< control register 1                                                    */
  __IO uint32_t  CR2;                               /*!< control register 2                                                    */
  __IO uint32_t  SMCR;                              /*!< slave mode control register                                           */
  __IO uint32_t  DIER;                              /*!< DMA/Interrupt enable register                                         */
  __IO uint32_t  SR;                                /*!< status register                                                       */
  __O  uint32_t  EGR;                               /*!< event generation register                                             */
  
  union {
    __IO uint32_t  CCMR1_Input;                     /*!< capture/compare mode register 1 (input mode)                          */
    __IO uint32_t  CCMR1_Output;                    /*!< capture/compare mode register (output mode)                           */
  } ;
  __I  uint32_t  RESERVED0;
  __IO uint32_t  CCER;                              /*!< capture/compare enable register                                       */
  __IO uint32_t  CNT;                               /*!< counter                                                               */
  __IO uint32_t  PSC;                               /*!< prescaler                                                             */
  __IO uint32_t  ARR;                               /*!< auto-reload register                                                  */
  __IO uint32_t  RCR;                               /*!< repetition counter register                                           */
  __IO uint32_t  CCR1;                              /*!< capture/compare register 1                                            */
  __IO uint32_t  CCR2;                              /*!< capture/compare register 2                                            */
  __I  uint32_t  RESERVED1[2];
  __IO uint32_t  BDTR;                              /*!< break and dead-time register                                          */
  __IO uint32_t  DCR;                               /*!< DMA control register                                                  */
  __IO uint32_t  DMAR;                              /*!< DMA address for full transfer                                         */
} TIM15_Type;


/* ================================================================================ */
/* ================                      TIM16                     ================ */
/* ================================================================================ */


/**
  * @brief General-purpose-timers (TIM16)
  */

typedef struct {                                    /*!< TIM16 Structure                                                       */
  __IO uint32_t  CR1;                               /*!< control register 1                                                    */
  __IO uint32_t  CR2;                               /*!< control register 2                                                    */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  DIER;                              /*!< DMA/Interrupt enable register                                         */
  __IO uint32_t  SR;                                /*!< status register                                                       */
  __O  uint32_t  EGR;                               /*!< event generation register                                             */
  
  union {
    __IO uint32_t  CCMR1_Input;                     /*!< capture/compare mode register 1 (input mode)                          */
    __IO uint32_t  CCMR1_Output;                    /*!< capture/compare mode register (output mode)                           */
  } ;
  __I  uint32_t  RESERVED1;
  __IO uint32_t  CCER;                              /*!< capture/compare enable register                                       */
  __IO uint32_t  CNT;                               /*!< counter                                                               */
  __IO uint32_t  PSC;                               /*!< prescaler                                                             */
  __IO uint32_t  ARR;                               /*!< auto-reload register                                                  */
  __IO uint32_t  RCR;                               /*!< repetition counter register                                           */
  __IO uint32_t  CCR1;                              /*!< capture/compare register 1                                            */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  BDTR;                              /*!< break and dead-time register                                          */
  __IO uint32_t  DCR;                               /*!< DMA control register                                                  */
  __IO uint32_t  DMAR;                              /*!< DMA address for full transfer                                         */
  __IO uint32_t  OR;                                /*!< option register                                                       */
} TIM16_Type;


/* ================================================================================ */
/* ================                      TIM17                     ================ */
/* ================================================================================ */


/**
  * @brief General purpose timer (TIM17)
  */

typedef struct {                                    /*!< TIM17 Structure                                                       */
  __IO uint32_t  CR1;                               /*!< control register 1                                                    */
  __IO uint32_t  CR2;                               /*!< control register 2                                                    */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  DIER;                              /*!< DMA/Interrupt enable register                                         */
  __IO uint32_t  SR;                                /*!< status register                                                       */
  __O  uint32_t  EGR;                               /*!< event generation register                                             */
  
  union {
    __IO uint32_t  CCMR1_Input;                     /*!< capture/compare mode register 1 (input mode)                          */
    __IO uint32_t  CCMR1_Output;                    /*!< capture/compare mode register (output mode)                           */
  } ;
  __I  uint32_t  RESERVED1;
  __IO uint32_t  CCER;                              /*!< capture/compare enable register                                       */
  __IO uint32_t  CNT;                               /*!< counter                                                               */
  __IO uint32_t  PSC;                               /*!< prescaler                                                             */
  __IO uint32_t  ARR;                               /*!< auto-reload register                                                  */
  __IO uint32_t  RCR;                               /*!< repetition counter register                                           */
  __IO uint32_t  CCR1;                              /*!< capture/compare register 1                                            */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  BDTR;                              /*!< break and dead-time register                                          */
  __IO uint32_t  DCR;                               /*!< DMA control register                                                  */
  __IO uint32_t  DMAR;                              /*!< DMA address for full transfer                                         */
} TIM17_Type;


/* ================================================================================ */
/* ================                     USART1                     ================ */
/* ================================================================================ */


/**
  * @brief Universal synchronous asynchronous receiver-transmitter (USART1)
  */

