fduignan/stm32f334/include/STM32F3x4.h
typedef struct {                                    /*!< USART1 Structure                                                      */
  __IO uint32_t  CR1;                               /*!< Control register 1                                                    */
  __IO uint32_t  CR2;                               /*!< Control register 2                                                    */
  __IO uint32_t  CR3;                               /*!< Control register 3                                                    */
  __IO uint32_t  BRR;                               /*!< Baud rate register                                                    */
  __IO uint32_t  GTPR;                              /*!< Guard time and prescaler register                                     */
  __IO uint32_t  RTOR;                              /*!< Receiver timeout register                                             */
  __IO uint32_t  RQR;                               /*!< Request register                                                      */
  __I  uint32_t  ISR;                               /*!< Interrupt & status register                                           */
  __IO uint32_t  ICR;                               /*!< Interrupt flag clear register                                         */
  __I  uint32_t  RDR;                               /*!< Receive data register                                                 */
  __IO uint32_t  TDR;                               /*!< Transmit data register                                                */
} USART1_Type;


/* ================================================================================ */
/* ================                      SPI2                      ================ */
/* ================================================================================ */


/**
  * @brief Serial peripheral interface/Inter-IC2 (SPI2)
  */

typedef struct {                                    /*!< SPI2 Structure                                                        */
  __IO uint32_t  CR1;                               /*!< control register 1                                                    */
  __IO uint32_t  CR2;                               /*!< control register 2                                                    */
  __IO uint32_t  SR;                                /*!< status register                                                       */
  __IO uint32_t  DR;                                /*!< data register                                                         */
  __IO uint32_t  CRCPR;                             /*!< CRC polynomial register                                               */
  __I  uint32_t  RXCRCR;                            /*!< RX CRC register                                                       */
  __I  uint32_t  TXCRCR;                            /*!< TX CRC register                                                       */
  __IO uint32_t  I2SCFGR;                           /*!< I2S configuration register                                            */
  __IO uint32_t  I2SPR;                             /*!< I2S prescaler register                                                */
} SPI2_Type;


/* ================================================================================ */
/* ================                      SPI3                      ================ */
/* ================================================================================ */


/**
  * @brief Serial peripheral interface/Inter-IC2 (SPI3)
  */

typedef struct {                                    /*!< SPI3 Structure                                                        */
  __IO uint32_t  CR1;                               /*!< control register 1                                                    */
  __IO uint32_t  CR2;                               /*!< control register 2                                                    */
  __IO uint32_t  SR;                                /*!< status register                                                       */
  __IO uint32_t  DR;                                /*!< data register                                                         */
  __IO uint32_t  CRCPR;                             /*!< CRC polynomial register                                               */
  __I  uint32_t  RXCRCR;                            /*!< RX CRC register                                                       */
  __I  uint32_t  TXCRCR;                            /*!< TX CRC register                                                       */
  __IO uint32_t  I2SCFGR;                           /*!< I2S configuration register                                            */
  __IO uint32_t  I2SPR;                             /*!< I2S prescaler register                                                */
} SPI3_Type;


/* ================================================================================ */
/* ================                      EXTI                      ================ */
/* ================================================================================ */


/**
  * @brief External interrupt/event controller (EXTI)
  */

typedef struct {                                    /*!< EXTI Structure                                                        */
  __IO uint32_t  IMR1;                              /*!< Interrupt mask register                                               */
  __IO uint32_t  EMR1;                              /*!< Event mask register                                                   */
  __IO uint32_t  RTSR1;                             /*!< Rising Trigger selection register                                     */
  __IO uint32_t  FTSR1;                             /*!< Falling Trigger selection register                                    */
  __IO uint32_t  SWIER1;                            /*!< Software interrupt event register                                     */
  __IO uint32_t  PR1;                               /*!< Pending register                                                      */
  __IO uint32_t  IMR2;                              /*!< Interrupt mask register                                               */
  __IO uint32_t  EMR2;                              /*!< Event mask register                                                   */
  __IO uint32_t  RTSR2;                             /*!< Rising Trigger selection register                                     */
  __IO uint32_t  FTSR2;                             /*!< Falling Trigger selection register                                    */
  __IO uint32_t  SWIER2;                            /*!< Software interrupt event register                                     */
  __IO uint32_t  PR2;                               /*!< Pending register                                                      */
} EXTI_Type;


/* ================================================================================ */
/* ================                       PWR                      ================ */
/* ================================================================================ */


/**
  * @brief Power control (PWR)
  */

typedef struct {                                    /*!< PWR Structure                                                         */
  __IO uint32_t  CR;                                /*!< power control register                                                */
  __IO uint32_t  CSR;                               /*!< power control/status register                                         */
} PWR_Type;


/* ================================================================================ */
/* ================                      I2C1                      ================ */
/* ================================================================================ */


/**
  * @brief Inter-integrated circuit (I2C1)
  */

typedef struct {                                    /*!< I2C1 Structure                                                        */
  __IO uint32_t  CR1;                               /*!< Control register 1                                                    */
  __IO uint32_t  CR2;                               /*!< Control register 2                                                    */
  __IO uint32_t  OAR1;                              /*!< Own address register 1                                                */
  __IO uint32_t  OAR2;                              /*!< Own address register 2                                                */
  __IO uint32_t  TIMINGR;                           /*!< Timing register                                                       */
  __IO uint32_t  TIMEOUTR;                          /*!< Status register 1                                                     */
  __IO uint32_t  ISR;                               /*!< Interrupt and Status register                                         */
  __O  uint32_t  ICR;                               /*!< Interrupt clear register                                              */
  __I  uint32_t  PECR;                              /*!< PEC register                                                          */
  __I  uint32_t  RXDR;                              /*!< Receive data register                                                 */
  __IO uint32_t  TXDR;                              /*!< Transmit data register                                                */
} I2C1_Type;


/* ================================================================================ */
/* ================                      IWDG                      ================ */
/* ================================================================================ */


/**
  * @brief Independent watchdog (IWDG)
  */

typedef struct {                                    /*!< IWDG Structure                                                        */
  __O  uint32_t  KR;                                /*!< Key register                                                          */
  __IO uint32_t  PR;                                /*!< Prescaler register                                                    */
  __IO uint32_t  RLR;                               /*!< Reload register                                                       */
  __I  uint32_t  SR;                                /*!< Status register                                                       */
  __IO uint32_t  WINR;                              /*!< Window register                                                       */
} IWDG_Type;


/* ================================================================================ */
/* ================                      WWDG                      ================ */
/* ================================================================================ */


/**
  * @brief Window watchdog (WWDG)
  */

typedef struct {                                    /*!< WWDG Structure                                                        */
  __IO uint32_t  CR;                                /*!< Control register                                                      */
  __IO uint32_t  CFR;                               /*!< Configuration register                                                */
  __IO uint32_t  SR;                                /*!< Status register                                                       */
} WWDG_Type;


/* ================================================================================ */
/* ================                       RTC                      ================ */
/* ================================================================================ */


/**
  * @brief Real-time clock (RTC)
  */

typedef struct {                                    /*!< RTC Structure                                                         */
  __IO uint32_t  TR;                                /*!< time register                                                         */
  __IO uint32_t  DR;                                /*!< date register                                                         */
  __IO uint32_t  CR;                                /*!< control register                                                      */
  __IO uint32_t  ISR;                               /*!< initialization and status register                                    */
  __IO uint32_t  PRER;                              /*!< prescaler register                                                    */
  __IO uint32_t  WUTR;                              /*!< wakeup timer register                                                 */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  ALRMAR;                            /*!< alarm A register                                                      */
  __IO uint32_t  ALRMBR;                            /*!< alarm B register                                                      */
  __O  uint32_t  WPR;                               /*!< write protection register                                             */
  __I  uint32_t  SSR;                               /*!< sub second register                                                   */
  __O  uint32_t  SHIFTR;                            /*!< shift control register                                                */
  __I  uint32_t  TSTR;                              /*!< time stamp time register                                              */
  __I  uint32_t  TSDR;                              /*!< time stamp date register                                              */
  __I  uint32_t  TSSSR;                             /*!< timestamp sub second register                                         */
  __IO uint32_t  CALR;                              /*!< calibration register                                                  */
  __IO uint32_t  TAFCR;                             /*!< tamper and alternate function configuration register                  */
  __IO uint32_t  ALRMASSR;                          /*!< alarm A sub second register                                           */
  __IO uint32_t  ALRMBSSR;                          /*!< alarm B sub second register                                           */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  BKP0R;                             /*!< backup register                                                       */
  __IO uint32_t  BKP1R;                             /*!< backup register                                                       */
  __IO uint32_t  BKP2R;                             /*!< backup register                                                       */
  __IO uint32_t  BKP3R;                             /*!< backup register                                                       */
  __IO uint32_t  BKP4R;                             /*!< backup register                                                       */
  __IO uint32_t  BKP5R;                             /*!< backup register                                                       */
  __IO uint32_t  BKP6R;                             /*!< backup register                                                       */
  __IO uint32_t  BKP7R;                             /*!< backup register                                                       */
  __IO uint32_t  BKP8R;                             /*!< backup register                                                       */
  __IO uint32_t  BKP9R;                             /*!< backup register                                                       */
  __IO uint32_t  BKP10R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP11R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP12R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP13R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP14R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP15R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP16R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP17R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP18R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP19R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP20R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP21R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP22R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP23R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP24R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP25R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP26R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP27R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP28R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP29R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP30R;                            /*!< backup register                                                       */
  __IO uint32_t  BKP31R;                            /*!< backup register                                                       */
} RTC_Type;


/* ================================================================================ */
/* ================                      TIM6                      ================ */
/* ================================================================================ */


/**
  * @brief Basic timers (TIM6)
  */

typedef struct {                                    /*!< TIM6 Structure                                                        */
  __IO uint32_t  CR1;                               /*!< control register 1                                                    */
  __IO uint32_t  CR2;                               /*!< control register 2                                                    */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  DIER;                              /*!< DMA/Interrupt enable register                                         */
  __IO uint32_t  SR;                                /*!< status register                                                       */
  __O  uint32_t  EGR;                               /*!< event generation register                                             */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  CNT;                               /*!< counter                                                               */
  __IO uint32_t  PSC;                               /*!< prescaler                                                             */
  __IO uint32_t  ARR;                               /*!< auto-reload register                                                  */
} TIM6_Type;


/* ================================================================================ */
/* ================                      DAC1                      ================ */
/* ================================================================================ */


/**
  * @brief Digital-to-analog converter (DAC1)
  */

typedef struct {                                    /*!< DAC1 Structure                                                        */
  __IO uint32_t  CR;                                /*!< control register                                                      */
  __O  uint32_t  SWTRIGR;                           /*!< software trigger register                                             */
  __IO uint32_t  DHR12R1;                           /*!< channel1 12-bit right-aligned data holding register                   */
  __IO uint32_t  DHR12L1;                           /*!< channel1 12-bit left aligned data holding register                    */
  __IO uint32_t  DHR8R1;                            /*!< channel1 8-bit right aligned data holding register                    */
  __IO uint32_t  DHR12R2;                           /*!< channel2 12-bit right aligned data holding register                   */
  __IO uint32_t  DHR12L2;                           /*!< channel2 12-bit left aligned data holding register                    */
  __IO uint32_t  DHR8R2;                            /*!< channel2 8-bit right-aligned data holding register                    */
  __IO uint32_t  DHR12RD;                           /*!< Dual DAC 12-bit right-aligned data holding register                   */
  __IO uint32_t  DHR12LD;                           /*!< DUAL DAC 12-bit left aligned data holding register                    */
  __IO uint32_t  DHR8RD;                            /*!< DUAL DAC 8-bit right aligned data holding register                    */
  __I  uint32_t  DOR1;                              /*!< channel1 data output register                                         */
  __I  uint32_t  DOR2;                              /*!< channel2 data output register                                         */
  __IO uint32_t  SR;                                /*!< status register                                                       */
} DAC1_Type;


/* ================================================================================ */
/* ================                     DBGMCU                     ================ */
/* ================================================================================ */


/**
  * @brief Debug support (DBGMCU)
  */

typedef struct {                                    /*!< DBGMCU Structure                                                      */
  __I  uint32_t  IDCODE;                            /*!< MCU Device ID Code Register                                           */
  __IO uint32_t  CR;                                /*!< Debug MCU Configuration Register                                      */
  __IO uint32_t  APB1FZ;                            /*!< APB Low Freeze Register                                               */
  __IO uint32_t  APB2FZ;                            /*!< APB High Freeze Register                                              */
} DBGMCU_Type;


/* ================================================================================ */
/* ================                      TIM1                      ================ */
/* ================================================================================ */


/**
  * @brief Advanced timer (TIM1)
  */

