fduignan/stm32f334/include/STM32F3x4.h
typedef struct {                                    /*!< TIM1 Structure                                                        */
  __IO uint32_t  CR1;                               /*!< control register 1                                                    */
  __IO uint32_t  CR2;                               /*!< control register 2                                                    */
  __IO uint32_t  SMCR;                              /*!< slave mode control register                                           */
  __IO uint32_t  DIER;                              /*!< DMA/Interrupt enable register                                         */
  __IO uint32_t  SR;                                /*!< status register                                                       */
  __O  uint32_t  EGR;                               /*!< event generation register                                             */
  
  union {
    __IO uint32_t  CCMR1_Input;                     /*!< capture/compare mode register 1 (input mode)                          */
    __IO uint32_t  CCMR1_Output;                    /*!< capture/compare mode register (output mode)                           */
  } ;
  
  union {
    __IO uint32_t  CCMR2_Input;                     /*!< capture/compare mode register 2 (input mode)                          */
    __IO uint32_t  CCMR2_Output;                    /*!< capture/compare mode register (output mode)                           */
  } ;
  __IO uint32_t  CCER;                              /*!< capture/compare enable register                                       */
  __IO uint32_t  CNT;                               /*!< counter                                                               */
  __IO uint32_t  PSC;                               /*!< prescaler                                                             */
  __IO uint32_t  ARR;                               /*!< auto-reload register                                                  */
  __IO uint32_t  RCR;                               /*!< repetition counter register                                           */
  __IO uint32_t  CCR1;                              /*!< capture/compare register 1                                            */
  __IO uint32_t  CCR2;                              /*!< capture/compare register 2                                            */
  __IO uint32_t  CCR3;                              /*!< capture/compare register 3                                            */
  __IO uint32_t  CCR4;                              /*!< capture/compare register 4                                            */
  __IO uint32_t  BDTR;                              /*!< break and dead-time register                                          */
  __IO uint32_t  DCR;                               /*!< DMA control register                                                  */
  __IO uint32_t  DMAR;                              /*!< DMA address for full transfer                                         */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  CCMR3_Output;                      /*!< capture/compare mode register 3 (output mode)                         */
  __IO uint32_t  CCR5;                              /*!< capture/compare register 5                                            */
  __IO uint32_t  CCR6;                              /*!< capture/compare register 6                                            */
  __IO uint32_t  OR;                                /*!< option registers                                                      */
} TIM1_Type;


/* ================================================================================ */
/* ================                      ADC1                      ================ */
/* ================================================================================ */


/**
  * @brief Analog-to-Digital Converter (ADC1)
  */

typedef struct {                                    /*!< ADC1 Structure                                                        */
  __IO uint32_t  ISR;                               /*!< interrupt and status register                                         */
  __IO uint32_t  IER;                               /*!< interrupt enable register                                             */
  __IO uint32_t  CR;                                /*!< control register                                                      */
  __IO uint32_t  CFGR;                              /*!< configuration register                                                */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  SMPR1;                             /*!< sample time register 1                                                */
  __IO uint32_t  SMPR2;                             /*!< sample time register 2                                                */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  TR1;                               /*!< watchdog threshold register 1                                         */
  __IO uint32_t  TR2;                               /*!< watchdog threshold register                                           */
  __IO uint32_t  TR3;                               /*!< watchdog threshold register 3                                         */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  SQR1;                              /*!< regular sequence register 1                                           */
  __IO uint32_t  SQR2;                              /*!< regular sequence register 2                                           */
  __IO uint32_t  SQR3;                              /*!< regular sequence register 3                                           */
  __IO uint32_t  SQR4;                              /*!< regular sequence register 4                                           */
  __I  uint32_t  DR;                                /*!< regular Data Register                                                 */
  __I  uint32_t  RESERVED3[2];
  __IO uint32_t  JSQR;                              /*!< injected sequence register                                            */
  __I  uint32_t  RESERVED4[4];
  __IO uint32_t  OFR1;                              /*!< offset register 1                                                     */
  __IO uint32_t  OFR2;                              /*!< offset register 2                                                     */
  __IO uint32_t  OFR3;                              /*!< offset register 3                                                     */
  __IO uint32_t  OFR4;                              /*!< offset register 4                                                     */
  __I  uint32_t  RESERVED5[4];
  __I  uint32_t  JDR1;                              /*!< injected data register 1                                              */
  __I  uint32_t  JDR2;                              /*!< injected data register 2                                              */
  __I  uint32_t  JDR3;                              /*!< injected data register 3                                              */
  __I  uint32_t  JDR4;                              /*!< injected data register 4                                              */
  __I  uint32_t  RESERVED6[4];
  __IO uint32_t  AWD2CR;                            /*!< Analog Watchdog 2 Configuration Register                              */
  __IO uint32_t  AWD3CR;                            /*!< Analog Watchdog 3 Configuration Register                              */
  __I  uint32_t  RESERVED7[2];
  __IO uint32_t  DIFSEL;                            /*!< Differential Mode Selection Register 2                                */
  __IO uint32_t  CALFACT;                           /*!< Calibration Factors                                                   */
} ADC1_Type;


/* ================================================================================ */
/* ================                SYSCFG_COMP_OPAMP               ================ */
/* ================================================================================ */


/**
  * @brief System configuration controller (SYSCFG_COMP_OPAMP)
  */

typedef struct {                                    /*!< SYSCFG_COMP_OPAMP Structure                                           */
  __IO uint32_t  SYSCFG_CFGR1;                      /*!< configuration register 1                                              */
  __IO uint32_t  SYSCFG_RCR;                        /*!< CCM SRAM protection register                                          */
  __IO uint32_t  SYSCFG_EXTICR1;                    /*!< external interrupt configuration register 1                           */
  __IO uint32_t  SYSCFG_EXTICR2;                    /*!< external interrupt configuration register 2                           */
  __IO uint32_t  SYSCFG_EXTICR3;                    /*!< external interrupt configuration register 3                           */
  __IO uint32_t  SYSCFG_EXTICR4;                    /*!< external interrupt configuration register 4                           */
  __IO uint32_t  SYSCFG_CFGR2;                      /*!< configuration register 2                                              */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  COMP2_CSR;                         /*!< control and status register                                           */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  COMP4_CSR;                         /*!< control and status register                                           */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  COMP6_CSR;                         /*!< control and status register                                           */
  __I  uint32_t  RESERVED3[2];
  __IO uint32_t  OPAMP2_CSR;                        /*!< OPAMP2 control register                                               */
  __I  uint32_t  RESERVED4[4];
  __IO uint32_t  SYSCFG_CFGR3;                      /*!< configuration register 3                                              */
} SYSCFG_COMP_OPAMP_Type;


/* ================================================================================ */
/* ================                      TIM3                      ================ */
/* ================================================================================ */


/**
  * @brief General purpose timer (TIM3)
  */

typedef struct {                                    /*!< TIM3 Structure                                                        */
  __IO uint32_t  CR1;                               /*!< control register 1                                                    */
  __IO uint32_t  CR2;                               /*!< control register 2                                                    */
  __IO uint32_t  SMCR;                              /*!< slave mode control register                                           */
  __IO uint32_t  DIER;                              /*!< DMA/Interrupt enable register                                         */
  __IO uint32_t  SR;                                /*!< status register                                                       */
  __O  uint32_t  EGR;                               /*!< event generation register                                             */
  
  union {
    __IO uint32_t  CCMR1_Input;                     /*!< capture/compare mode register 1 (input mode)                          */
    __IO uint32_t  CCMR1_Output;                    /*!< capture/compare mode register 1 (output mode)                         */
  } ;
  
  union {
    __IO uint32_t  CCMR2_Input;                     /*!< capture/compare mode register 2 (input mode)                          */
    __IO uint32_t  CCMR2_Output;                    /*!< capture/compare mode register 2 (output mode)                         */
  } ;
  __IO uint32_t  CCER;                              /*!< capture/compare enable register                                       */
  __IO uint32_t  CNT;                               /*!< counter                                                               */
  __IO uint32_t  PSC;                               /*!< prescaler                                                             */
  __IO uint32_t  ARR;                               /*!< auto-reload register                                                  */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  CCR1;                              /*!< capture/compare register 1                                            */
  __IO uint32_t  CCR2;                              /*!< capture/compare register 2                                            */
  __IO uint32_t  CCR3;                              /*!< capture/compare register 3                                            */
  __IO uint32_t  CCR4;                              /*!< capture/compare register 4                                            */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  DCR;                               /*!< DMA control register                                                  */
  __IO uint32_t  DMAR;                              /*!< DMA address for full transfer                                         */
} TIM3_Type;


/* ================================================================================ */
/* ================                       CAN                      ================ */
/* ================================================================================ */


/**
  * @brief Controller area network (CAN)
  */

