fduignan/stm32f334/include/STM32F3x4.h
typedef struct {                                    /*!< CAN Structure                                                         */
  __IO uint32_t  MCR;                               /*!< master control register                                               */
  __IO uint32_t  MSR;                               /*!< master status register                                                */
  __IO uint32_t  TSR;                               /*!< transmit status register                                              */
  __IO uint32_t  RF0R;                              /*!< receive FIFO 0 register                                               */
  __IO uint32_t  RF1R;                              /*!< receive FIFO 1 register                                               */
  __IO uint32_t  IER;                               /*!< interrupt enable register                                             */
  __IO uint32_t  ESR;                               /*!< error status register                                                 */
  __IO uint32_t  BTR;                               /*!< bit timing register                                                   */
  __I  uint32_t  RESERVED0[88];
  __IO uint32_t  TI0R;                              /*!< TX mailbox identifier register                                        */
  __IO uint32_t  TDT0R;                             /*!< mailbox data length control and time stamp register                   */
  __IO uint32_t  TDL0R;                             /*!< mailbox data low register                                             */
  __IO uint32_t  TDH0R;                             /*!< mailbox data high register                                            */
  __IO uint32_t  TI1R;                              /*!< TX mailbox identifier register                                        */
  __IO uint32_t  TDT1R;                             /*!< mailbox data length control and time stamp register                   */
  __IO uint32_t  TDL1R;                             /*!< mailbox data low register                                             */
  __IO uint32_t  TDH1R;                             /*!< mailbox data high register                                            */
  __IO uint32_t  TI2R;                              /*!< TX mailbox identifier register                                        */
  __IO uint32_t  TDT2R;                             /*!< mailbox data length control and time stamp register                   */
  __IO uint32_t  TDL2R;                             /*!< mailbox data low register                                             */
  __IO uint32_t  TDH2R;                             /*!< mailbox data high register                                            */
  __I  uint32_t  RI0R;                              /*!< receive FIFO mailbox identifier register                              */
  __I  uint32_t  RDT0R;                             /*!< receive FIFO mailbox data length control and time stamp register      */
  __I  uint32_t  RDL0R;                             /*!< receive FIFO mailbox data low register                                */
  __I  uint32_t  RDH0R;                             /*!< receive FIFO mailbox data high register                               */
  __I  uint32_t  RI1R;                              /*!< receive FIFO mailbox identifier register                              */
  __I  uint32_t  RDT1R;                             /*!< receive FIFO mailbox data length control and time stamp register      */
  __I  uint32_t  RDL1R;                             /*!< receive FIFO mailbox data low register                                */
  __I  uint32_t  RDH1R;                             /*!< receive FIFO mailbox data high register                               */
  __I  uint32_t  RESERVED1[12];
  __IO uint32_t  FMR;                               /*!< filter master register                                                */
  __IO uint32_t  FM1R;                              /*!< filter mode register                                                  */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  FS1R;                              /*!< filter scale register                                                 */
  __I  uint32_t  RESERVED3;
  __IO uint32_t  FFA1R;                             /*!< filter FIFO assignment register                                       */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  FA1R;                              /*!< CAN filter activation register                                        */
  __I  uint32_t  RESERVED5[8];
  __IO uint32_t  F0R1;                              /*!< Filter bank 0 register 1                                              */
  __IO uint32_t  F0R2;                              /*!< Filter bank 0 register 2                                              */
  __IO uint32_t  F1R1;                              /*!< Filter bank 1 register 1                                              */
  __IO uint32_t  F1R2;                              /*!< Filter bank 1 register 2                                              */
  __IO uint32_t  F2R1;                              /*!< Filter bank 2 register 1                                              */
  __IO uint32_t  F2R2;                              /*!< Filter bank 2 register 2                                              */
  __IO uint32_t  F3R1;                              /*!< Filter bank 3 register 1                                              */
  __IO uint32_t  F3R2;                              /*!< Filter bank 3 register 2                                              */
  __IO uint32_t  F4R1;                              /*!< Filter bank 4 register 1                                              */
  __IO uint32_t  F4R2;                              /*!< Filter bank 4 register 2                                              */
  __IO uint32_t  F5R1;                              /*!< Filter bank 5 register 1                                              */
  __IO uint32_t  F5R2;                              /*!< Filter bank 5 register 2                                              */
  __IO uint32_t  F6R1;                              /*!< Filter bank 6 register 1                                              */
  __IO uint32_t  F6R2;                              /*!< Filter bank 6 register 2                                              */
  __IO uint32_t  F7R1;                              /*!< Filter bank 7 register 1                                              */
  __IO uint32_t  F7R2;                              /*!< Filter bank 7 register 2                                              */
  __IO uint32_t  F8R1;                              /*!< Filter bank 8 register 1                                              */
  __IO uint32_t  F8R2;                              /*!< Filter bank 8 register 2                                              */
  __IO uint32_t  F9R1;                              /*!< Filter bank 9 register 1                                              */
  __IO uint32_t  F9R2;                              /*!< Filter bank 9 register 2                                              */
  __IO uint32_t  F10R1;                             /*!< Filter bank 10 register 1                                             */
  __IO uint32_t  F10R2;                             /*!< Filter bank 10 register 2                                             */
  __IO uint32_t  F11R1;                             /*!< Filter bank 11 register 1                                             */
  __IO uint32_t  F11R2;                             /*!< Filter bank 11 register 2                                             */
  __IO uint32_t  F12R1;                             /*!< Filter bank 4 register 1                                              */
  __IO uint32_t  F12R2;                             /*!< Filter bank 12 register 2                                             */
  __IO uint32_t  F13R1;                             /*!< Filter bank 13 register 1                                             */
  __IO uint32_t  F13R2;                             /*!< Filter bank 13 register 2                                             */
  __IO uint32_t  F14R1;                             /*!< Filter bank 14 register 1                                             */
  __IO uint32_t  F14R2;                             /*!< Filter bank 14 register 2                                             */
  __IO uint32_t  F15R1;                             /*!< Filter bank 15 register 1                                             */
  __IO uint32_t  F15R2;                             /*!< Filter bank 15 register 2                                             */
  __IO uint32_t  F16R1;                             /*!< Filter bank 16 register 1                                             */
  __IO uint32_t  F16R2;                             /*!< Filter bank 16 register 2                                             */
  __IO uint32_t  F17R1;                             /*!< Filter bank 17 register 1                                             */
  __IO uint32_t  F17R2;                             /*!< Filter bank 17 register 2                                             */
  __IO uint32_t  F18R1;                             /*!< Filter bank 18 register 1                                             */
  __IO uint32_t  F18R2;                             /*!< Filter bank 18 register 2                                             */
  __IO uint32_t  F19R1;                             /*!< Filter bank 19 register 1                                             */
  __IO uint32_t  F19R2;                             /*!< Filter bank 19 register 2                                             */
  __IO uint32_t  F20R1;                             /*!< Filter bank 20 register 1                                             */
  __IO uint32_t  F20R2;                             /*!< Filter bank 20 register 2                                             */
  __IO uint32_t  F21R1;                             /*!< Filter bank 21 register 1                                             */
  __IO uint32_t  F21R2;                             /*!< Filter bank 21 register 2                                             */
  __IO uint32_t  F22R1;                             /*!< Filter bank 22 register 1                                             */
  __IO uint32_t  F22R2;                             /*!< Filter bank 22 register 2                                             */
  __IO uint32_t  F23R1;                             /*!< Filter bank 23 register 1                                             */
  __IO uint32_t  F23R2;                             /*!< Filter bank 23 register 2                                             */
  __IO uint32_t  F24R1;                             /*!< Filter bank 24 register 1                                             */
  __IO uint32_t  F24R2;                             /*!< Filter bank 24 register 2                                             */
  __IO uint32_t  F25R1;                             /*!< Filter bank 25 register 1                                             */
  __IO uint32_t  F25R2;                             /*!< Filter bank 25 register 2                                             */
  __IO uint32_t  F26R1;                             /*!< Filter bank 26 register 1                                             */
  __IO uint32_t  F26R2;                             /*!< Filter bank 26 register 2                                             */
  __IO uint32_t  F27R1;                             /*!< Filter bank 27 register 1                                             */
  __IO uint32_t  F27R2;                             /*!< Filter bank 27 register 2                                             */
} CAN_Type;


/* ================================================================================ */
/* ================                   ADC_Common                   ================ */
/* ================================================================================ */


/**
  * @brief ADC common registers (ADC_Common)
  */

typedef struct {                                    /*!< ADC_Common Structure                                                  */
  __I  uint32_t  ADC1_CSR;                          /*!< ADC Common status register                                            */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  ADC1_CCR;                          /*!< ADC common control register                                           */
  __I  uint32_t  ADC1_CDR;                          /*!< ADC common regular data register for dual mode                        */
} ADC_Common_Type;


/* ================================================================================ */
/* ================                  HRTIM_Master                  ================ */
/* ================================================================================ */


/**
  * @brief High Resolution Timer: Master Timers (HRTIM_Master)
  */

typedef struct {                                    /*!< HRTIM_Master Structure                                                */
  __IO uint32_t  MCR;                               /*!< Master Timer Control Register                                         */
  __I  uint32_t  MISR;                              /*!< Master Timer Interrupt Status Register                                */
  __O  uint32_t  MICR;                              /*!< Master Timer Interrupt Clear Register                                 */
  __IO uint32_t  MDIER4;                            /*!< MDIER4                                                                */
  __IO uint32_t  MCNTR;                             /*!< Master Timer Counter Register                                         */
  __IO uint32_t  MPER;                              /*!< Master Timer Period Register                                          */
  __IO uint32_t  MREP;                              /*!< Master Timer Repetition Register                                      */
  __IO uint32_t  MCMP1R;                            /*!< Master Timer Compare 1 Register                                       */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  MCMP2R;                            /*!< Master Timer Compare 2 Register                                       */
  __IO uint32_t  MCMP3R;                            /*!< Master Timer Compare 3 Register                                       */
  __IO uint32_t  MCMP4R;                            /*!< Master Timer Compare 4 Register                                       */
} HRTIM_Master_Type;


/* ================================================================================ */
/* ================                   HRTIM_TIMA                   ================ */
/* ================================================================================ */


/**
  * @brief High Resolution Timer: TIMA (HRTIM_TIMA)
  */

