fduignan/stm32f334/include/STM32F3x4.h
typedef struct {                                    /*!< HRTIM_TIMA Structure                                                  */
  __IO uint32_t  TIMACR;                            /*!< Timerx Control Register                                               */
  __I  uint32_t  TIMAISR;                           /*!< Timerx Interrupt Status Register                                      */
  __O  uint32_t  TIMAICR;                           /*!< Timerx Interrupt Clear Register                                       */
  __IO uint32_t  TIMADIER5;                         /*!< TIMxDIER5                                                             */
  __IO uint32_t  CNTAR;                             /*!< Timerx Counter Register                                               */
  __IO uint32_t  PERAR;                             /*!< Timerx Period Register                                                */
  __IO uint32_t  REPAR;                             /*!< Timerx Repetition Register                                            */
  __IO uint32_t  CMP1AR;                            /*!< Timerx Compare 1 Register                                             */
  __IO uint32_t  CMP1CAR;                           /*!< Timerx Compare 1 Compound Register                                    */
  __IO uint32_t  CMP2AR;                            /*!< Timerx Compare 2 Register                                             */
  __IO uint32_t  CMP3AR;                            /*!< Timerx Compare 3 Register                                             */
  __IO uint32_t  CMP4AR;                            /*!< Timerx Compare 4 Register                                             */
  __I  uint32_t  CPT1AR;                            /*!< Timerx Capture 1 Register                                             */
  __I  uint32_t  CPT2AR;                            /*!< Timerx Capture 2 Register                                             */
  __IO uint32_t  DTAR;                              /*!< Timerx Deadtime Register                                              */
  __IO uint32_t  SETA1R;                            /*!< Timerx Output1 Set Register                                           */
  __IO uint32_t  RSTA1R;                            /*!< Timerx Output1 Reset Register                                         */
  __IO uint32_t  SETA2R;                            /*!< Timerx Output2 Set Register                                           */
  __IO uint32_t  RSTA2R;                            /*!< Timerx Output2 Reset Register                                         */
  __IO uint32_t  EEFAR1;                            /*!< Timerx External Event Filtering Register 1                            */
  __IO uint32_t  EEFAR2;                            /*!< Timerx External Event Filtering Register 2                            */
  __IO uint32_t  RSTAR;                             /*!< TimerA Reset Register                                                 */
  __IO uint32_t  CHPAR;                             /*!< Timerx Chopper Register                                               */
  __IO uint32_t  CPT1ACR;                           /*!< Timerx Capture 2 Control Register                                     */
  __IO uint32_t  CPT2ACR;                           /*!< CPT2xCR                                                               */
  __IO uint32_t  OUTAR;                             /*!< Timerx Output Register                                                */
  __IO uint32_t  FLTAR;                             /*!< Timerx Fault Register                                                 */
} HRTIM_TIMA_Type;


/* ================================================================================ */
/* ================                   HRTIM_TIMB                   ================ */
/* ================================================================================ */


/**
  * @brief High Resolution Timer: TIMB (HRTIM_TIMB)
  */

typedef struct {                                    /*!< HRTIM_TIMB Structure                                                  */
  __IO uint32_t  TIMBCR;                            /*!< Timerx Control Register                                               */
  __I  uint32_t  TIMBISR;                           /*!< Timerx Interrupt Status Register                                      */
  __O  uint32_t  TIMBICR;                           /*!< Timerx Interrupt Clear Register                                       */
  __IO uint32_t  TIMBDIER5;                         /*!< TIMxDIER5                                                             */
  __IO uint32_t  CNTR;                              /*!< Timerx Counter Register                                               */
  __IO uint32_t  PERBR;                             /*!< Timerx Period Register                                                */
  __IO uint32_t  REPBR;                             /*!< Timerx Repetition Register                                            */
  __IO uint32_t  CMP1BR;                            /*!< Timerx Compare 1 Register                                             */
  __IO uint32_t  CMP1CBR;                           /*!< Timerx Compare 1 Compound Register                                    */
  __IO uint32_t  CMP2BR;                            /*!< Timerx Compare 2 Register                                             */
  __IO uint32_t  CMP3BR;                            /*!< Timerx Compare 3 Register                                             */
  __IO uint32_t  CMP4BR;                            /*!< Timerx Compare 4 Register                                             */
  __I  uint32_t  CPT1BR;                            /*!< Timerx Capture 1 Register                                             */
  __I  uint32_t  CPT2BR;                            /*!< Timerx Capture 2 Register                                             */
  __IO uint32_t  DTBR;                              /*!< Timerx Deadtime Register                                              */
  __IO uint32_t  SETB1R;                            /*!< Timerx Output1 Set Register                                           */
  __IO uint32_t  RSTB1R;                            /*!< Timerx Output1 Reset Register                                         */
  __IO uint32_t  SETB2R;                            /*!< Timerx Output2 Set Register                                           */
  __IO uint32_t  RSTB2R;                            /*!< Timerx Output2 Reset Register                                         */
  __IO uint32_t  EEFBR1;                            /*!< Timerx External Event Filtering Register 1                            */
  __IO uint32_t  EEFBR2;                            /*!< Timerx External Event Filtering Register 2                            */
  __IO uint32_t  RSTBR;                             /*!< TimerA Reset Register                                                 */
  __IO uint32_t  CHPBR;                             /*!< Timerx Chopper Register                                               */
  __IO uint32_t  CPT1BCR;                           /*!< Timerx Capture 2 Control Register                                     */
  __IO uint32_t  CPT2BCR;                           /*!< CPT2xCR                                                               */
  __IO uint32_t  OUTBR;                             /*!< Timerx Output Register                                                */
  __IO uint32_t  FLTBR;                             /*!< Timerx Fault Register                                                 */
} HRTIM_TIMB_Type;


/* ================================================================================ */
/* ================                   HRTIM_TIMC                   ================ */
/* ================================================================================ */


/**
  * @brief High Resolution Timer: TIMC (HRTIM_TIMC)
  */

