fduignan/stm32f334/include/STM32F3x4.h
typedef struct {                                    /*!< HRTIM_TIMC Structure                                                  */
  __IO uint32_t  TIMCCR;                            /*!< Timerx Control Register                                               */
  __I  uint32_t  TIMCISR;                           /*!< Timerx Interrupt Status Register                                      */
  __O  uint32_t  TIMCICR;                           /*!< Timerx Interrupt Clear Register                                       */
  __IO uint32_t  TIMCDIER5;                         /*!< TIMxDIER5                                                             */
  __IO uint32_t  CNTCR;                             /*!< Timerx Counter Register                                               */
  __IO uint32_t  PERCR;                             /*!< Timerx Period Register                                                */
  __IO uint32_t  REPCR;                             /*!< Timerx Repetition Register                                            */
  __IO uint32_t  CMP1CR;                            /*!< Timerx Compare 1 Register                                             */
  __IO uint32_t  CMP1CCR;                           /*!< Timerx Compare 1 Compound Register                                    */
  __IO uint32_t  CMP2CR;                            /*!< Timerx Compare 2 Register                                             */
  __IO uint32_t  CMP3CR;                            /*!< Timerx Compare 3 Register                                             */
  __IO uint32_t  CMP4CR;                            /*!< Timerx Compare 4 Register                                             */
  __I  uint32_t  CPT1CR;                            /*!< Timerx Capture 1 Register                                             */
  __I  uint32_t  CPT2CR;                            /*!< Timerx Capture 2 Register                                             */
  __IO uint32_t  DTCR;                              /*!< Timerx Deadtime Register                                              */
  __IO uint32_t  SETC1R;                            /*!< Timerx Output1 Set Register                                           */
  __IO uint32_t  RSTC1R;                            /*!< Timerx Output1 Reset Register                                         */
  __IO uint32_t  SETC2R;                            /*!< Timerx Output2 Set Register                                           */
  __IO uint32_t  RSTC2R;                            /*!< Timerx Output2 Reset Register                                         */
  __IO uint32_t  EEFCR1;                            /*!< Timerx External Event Filtering Register 1                            */
  __IO uint32_t  EEFCR2;                            /*!< Timerx External Event Filtering Register 2                            */
  __IO uint32_t  RSTCR;                             /*!< TimerA Reset Register                                                 */
  __IO uint32_t  CHPCR;                             /*!< Timerx Chopper Register                                               */
  __IO uint32_t  CPT1CCR;                           /*!< Timerx Capture 2 Control Register                                     */
  __IO uint32_t  CPT2CCR;                           /*!< CPT2xCR                                                               */
  __IO uint32_t  OUTCR;                             /*!< Timerx Output Register                                                */
  __IO uint32_t  FLTCR;                             /*!< Timerx Fault Register                                                 */
} HRTIM_TIMC_Type;


/* ================================================================================ */
/* ================                   HRTIM_TIMD                   ================ */
/* ================================================================================ */


/**
  * @brief High Resolution Timer: TIMD (HRTIM_TIMD)
  */

typedef struct {                                    /*!< HRTIM_TIMD Structure                                                  */
  __IO uint32_t  TIMDCR;                            /*!< Timerx Control Register                                               */
  __I  uint32_t  TIMDISR;                           /*!< Timerx Interrupt Status Register                                      */
  __O  uint32_t  TIMDICR;                           /*!< Timerx Interrupt Clear Register                                       */
  __IO uint32_t  TIMDDIER5;                         /*!< TIMxDIER5                                                             */
  __IO uint32_t  CNTDR;                             /*!< Timerx Counter Register                                               */
  __IO uint32_t  PERDR;                             /*!< Timerx Period Register                                                */
  __IO uint32_t  REPDR;                             /*!< Timerx Repetition Register                                            */
  __IO uint32_t  CMP1DR;                            /*!< Timerx Compare 1 Register                                             */
  __IO uint32_t  CMP1CDR;                           /*!< Timerx Compare 1 Compound Register                                    */
  __IO uint32_t  CMP2DR;                            /*!< Timerx Compare 2 Register                                             */
  __IO uint32_t  CMP3DR;                            /*!< Timerx Compare 3 Register                                             */
  __IO uint32_t  CMP4DR;                            /*!< Timerx Compare 4 Register                                             */
  __I  uint32_t  CPT1DR;                            /*!< Timerx Capture 1 Register                                             */
  __I  uint32_t  CPT2DR;                            /*!< Timerx Capture 2 Register                                             */
  __IO uint32_t  DTDR;                              /*!< Timerx Deadtime Register                                              */
  __IO uint32_t  SETD1R;                            /*!< Timerx Output1 Set Register                                           */
  __IO uint32_t  RSTD1R;                            /*!< Timerx Output1 Reset Register                                         */
  __IO uint32_t  SETD2R;                            /*!< Timerx Output2 Set Register                                           */
  __IO uint32_t  RSTD2R;                            /*!< Timerx Output2 Reset Register                                         */
  __IO uint32_t  EEFDR1;                            /*!< Timerx External Event Filtering Register 1                            */
  __IO uint32_t  EEFDR2;                            /*!< Timerx External Event Filtering Register 2                            */
  __IO uint32_t  RSTDR;                             /*!< TimerA Reset Register                                                 */
  __IO uint32_t  CHPDR;                             /*!< Timerx Chopper Register                                               */
  __IO uint32_t  CPT1DCR;                           /*!< Timerx Capture 2 Control Register                                     */
  __IO uint32_t  CPT2DCR;                           /*!< CPT2xCR                                                               */
  __IO uint32_t  OUTDR;                             /*!< Timerx Output Register                                                */
  __IO uint32_t  FLTDR;                             /*!< Timerx Fault Register                                                 */
} HRTIM_TIMD_Type;


/* ================================================================================ */
/* ================                   HRTIM_TIME                   ================ */
/* ================================================================================ */


/**
  * @brief High Resolution Timer: TIME (HRTIM_TIME)
  */

typedef struct {                                    /*!< HRTIM_TIME Structure                                                  */
  __IO uint32_t  TIMECR;                            /*!< Timerx Control Register                                               */
  __I  uint32_t  TIMEISR;                           /*!< Timerx Interrupt Status Register                                      */
  __O  uint32_t  TIMEICR;                           /*!< Timerx Interrupt Clear Register                                       */
  __IO uint32_t  TIMEDIER5;                         /*!< TIMxDIER5                                                             */
  __IO uint32_t  CNTER;                             /*!< Timerx Counter Register                                               */
  __IO uint32_t  PERER;                             /*!< Timerx Period Register                                                */
  __IO uint32_t  REPER;                             /*!< Timerx Repetition Register                                            */
  __IO uint32_t  CMP1ER;                            /*!< Timerx Compare 1 Register                                             */
  __IO uint32_t  CMP1CER;                           /*!< Timerx Compare 1 Compound Register                                    */
  __IO uint32_t  CMP2ER;                            /*!< Timerx Compare 2 Register                                             */
  __IO uint32_t  CMP3ER;                            /*!< Timerx Compare 3 Register                                             */
  __IO uint32_t  CMP4ER;                            /*!< Timerx Compare 4 Register                                             */
  __I  uint32_t  CPT1ER;                            /*!< Timerx Capture 1 Register                                             */
  __I  uint32_t  CPT2ER;                            /*!< Timerx Capture 2 Register                                             */
  __IO uint32_t  DTER;                              /*!< Timerx Deadtime Register                                              */
  __IO uint32_t  SETE1R;                            /*!< Timerx Output1 Set Register                                           */
  __IO uint32_t  RSTE1R;                            /*!< Timerx Output1 Reset Register                                         */
  __IO uint32_t  SETE2R;                            /*!< Timerx Output2 Set Register                                           */
  __IO uint32_t  RSTE2R;                            /*!< Timerx Output2 Reset Register                                         */
  __IO uint32_t  EEFER1;                            /*!< Timerx External Event Filtering Register 1                            */
  __IO uint32_t  EEFER2;                            /*!< Timerx External Event Filtering Register 2                            */
  __IO uint32_t  RSTER;                             /*!< TimerA Reset Register                                                 */
  __IO uint32_t  CHPER;                             /*!< Timerx Chopper Register                                               */
  __IO uint32_t  CPT1ECR;                           /*!< Timerx Capture 2 Control Register                                     */
  __IO uint32_t  CPT2ECR;                           /*!< CPT2xCR                                                               */
  __IO uint32_t  OUTER;                             /*!< Timerx Output Register                                                */
  __IO uint32_t  FLTER;                             /*!< Timerx Fault Register                                                 */
} HRTIM_TIME_Type;


/* ================================================================================ */
/* ================                  HRTIM_Common                  ================ */
/* ================================================================================ */


/**
  * @brief High Resolution Timer: Common functions (HRTIM_Common)
  */

