fduignan/stm32f334/include/STM32F3x4.h
typedef struct {                                    /*!< HRTIM_Common Structure                                                */
  __IO uint32_t  CR1;                               /*!< Control Register 1                                                    */
  __IO uint32_t  CR2;                               /*!< Control Register 2                                                    */
  __IO uint32_t  ISR;                               /*!< Interrupt Status Register                                             */
  __IO uint32_t  ICR;                               /*!< Interrupt Clear Register                                              */
  __IO uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  OENR;                              /*!< Output Enable Register                                                */
  __IO uint32_t  ODISR;                             /*!< DISR                                                                  */
  __I  uint32_t  ODSR;                              /*!< Output Disable Status Register                                        */
  __IO uint32_t  BMCR;                              /*!< Burst Mode Control Register                                           */
  __IO uint32_t  BMTRGR;                            /*!< BMTRGR                                                                */
  __IO uint32_t  BMCMPR;                            /*!< BMCMPR                                                                */
  __IO uint32_t  BMPER;                             /*!< Burst Mode Period Register                                            */
  __IO uint32_t  EECR1;                             /*!< Timer External Event Control Register 1                               */
  __IO uint32_t  EECR2;                             /*!< Timer External Event Control Register 2                               */
  __IO uint32_t  EECR3;                             /*!< Timer External Event Control Register 3                               */
  __IO uint32_t  ADC1R;                             /*!< ADC Trigger 1 Register                                                */
  __IO uint32_t  ADC2R;                             /*!< ADC Trigger 2 Register                                                */
  __IO uint32_t  ADC3R;                             /*!< ADC Trigger 3 Register                                                */
  __IO uint32_t  ADC4R;                             /*!< ADC Trigger 4 Register                                                */
  __IO uint32_t  DLLCR;                             /*!< DLL Control Register                                                  */
  __IO uint32_t  FLTINR1;                           /*!< HRTIM Fault Input Register 1                                          */
  __IO uint32_t  FLTINR2;                           /*!< HRTIM Fault Input Register 2                                          */
  __IO uint32_t  BDMUPDR;                           /*!< BDMUPDR                                                               */
  __IO uint32_t  BDTAUPR;                           /*!< Burst DMA Timerx update Register                                      */
  __IO uint32_t  BDTBUPR;                           /*!< Burst DMA Timerx update Register                                      */
  __IO uint32_t  BDTCUPR;                           /*!< Burst DMA Timerx update Register                                      */
  __IO uint32_t  BDTDUPR;                           /*!< Burst DMA Timerx update Register                                      */
  __IO uint32_t  BDTEUPR;                           /*!< Burst DMA Timerx update Register                                      */
  __IO uint32_t  BDMADR;                            /*!< Burst DMA Data Register                                               */
} HRTIM_Common_Type;


/* ================================================================================ */
/* ================                      NVIC                      ================ */
/* ================================================================================ */


/**
  * @brief Nested Vectored Interrupt Controller (NVIC)
  */

typedef struct {                                    /*!< NVIC Structure                                                        */
  __IO uint32_t  ISER0;                             /*!< Interrupt Set-Enable Register                                         */
  __IO uint32_t  ISER1;                             /*!< Interrupt Set-Enable Register                                         */
  __IO uint32_t  ISER2;                             /*!< Interrupt Set-Enable Register                                         */
  __I  uint32_t  RESERVED0[29];
  __IO uint32_t  ICER0;                             /*!< Interrupt Clear-Enable Register                                       */
  __IO uint32_t  ICER1;                             /*!< Interrupt Clear-Enable Register                                       */
  __IO uint32_t  ICER2;                             /*!< Interrupt Clear-Enable Register                                       */
  __I  uint32_t  RESERVED1[29];
  __IO uint32_t  ISPR0;                             /*!< Interrupt Set-Pending Register                                        */
  __IO uint32_t  ISPR1;                             /*!< Interrupt Set-Pending Register                                        */
  __IO uint32_t  ISPR2;                             /*!< Interrupt Set-Pending Register                                        */
  __I  uint32_t  RESERVED2[29];
  __IO uint32_t  ICPR0;                             /*!< Interrupt Clear-Pending Register                                      */
  __IO uint32_t  ICPR1;                             /*!< Interrupt Clear-Pending Register                                      */
  __IO uint32_t  ICPR2;                             /*!< Interrupt Clear-Pending Register                                      */
  __I  uint32_t  RESERVED3[29];
  __I  uint32_t  IABR0;                             /*!< Interrupt Active Bit Register                                         */
  __I  uint32_t  IABR1;                             /*!< Interrupt Active Bit Register                                         */
  __I  uint32_t  IABR2;                             /*!< Interrupt Active Bit Register                                         */
  __I  uint32_t  RESERVED4[61];
  __IO uint32_t  IPR0;                              /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR1;                              /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR2;                              /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR3;                              /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR4;                              /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR5;                              /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR6;                              /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR7;                              /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR8;                              /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR9;                              /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR10;                             /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR11;                             /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR12;                             /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR13;                             /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR14;                             /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR15;                             /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR16;                             /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR17;                             /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR18;                             /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR19;                             /*!< Interrupt Priority Register                                           */
  __IO uint32_t  IPR20;                             /*!< Interrupt Priority Register                                           */
} NVIC_Type;


/* ================================================================================ */
/* ================                       FPU                      ================ */
/* ================================================================================ */


/**
  * @brief Floting point unit (FPU)
  */

typedef struct {                                    /*!< FPU Structure                                                         */
  __IO uint32_t  FPCCR;                             /*!< Floating-point context control register                               */
  __IO uint32_t  FPCAR;                             /*!< Floating-point context address register                               */
  __IO uint32_t  FPSCR;                             /*!< Floating-point status control register                                */
} FPU_Type;


/* ================================================================================ */
/* ================                       MPU                      ================ */
/* ================================================================================ */


/**
  * @brief Memory protection unit (MPU)
  */

