fduignan/stm32f334/include/STM32F3x4.h
typedef struct {                                    /*!< MPU Structure                                                         */
  __I  uint32_t  MPU_TYPER;                         /*!< MPU type register                                                     */
  __I  uint32_t  MPU_CTRL;                          /*!< MPU control register                                                  */
  __IO uint32_t  MPU_RNR;                           /*!< MPU region number register                                            */
  __IO uint32_t  MPU_RBAR;                          /*!< MPU region base address register                                      */
  __IO uint32_t  MPU_RASR;                          /*!< MPU region attribute and size register                                */
} MPU_Type;


/* ================================================================================ */
/* ================                       STK                      ================ */
/* ================================================================================ */


/**
  * @brief SysTick timer (STK)
  */

typedef struct {                                    /*!< STK Structure                                                         */
  __IO uint32_t  CTRL;                              /*!< SysTick control and status register                                   */
  __IO uint32_t  LOAD;                              /*!< SysTick reload value register                                         */
  __IO uint32_t  VAL;                               /*!< SysTick current value register                                        */
  __IO uint32_t  CALIB;                             /*!< SysTick calibration value register                                    */
} STK_Type;


/* ================================================================================ */
/* ================                       SCB                      ================ */
/* ================================================================================ */


/**
  * @brief System control block (SCB)
  */

typedef struct {                                    /*!< SCB Structure                                                         */
  __I  uint32_t  CPUID;                             /*!< CPUID base register                                                   */
  __IO uint32_t  ICSR;                              /*!< Interrupt control and state register                                  */
  __IO uint32_t  VTOR;                              /*!< Vector table offset register                                          */
  __IO uint32_t  AIRCR;                             /*!< Application interrupt and reset control register                      */
  __IO uint32_t  SCR;                               /*!< System control register                                               */
  __IO uint32_t  CCR;                               /*!< Configuration and control register                                    */
  __IO uint32_t  SHPR1;                             /*!< System handler priority registers                                     */
  __IO uint32_t  SHPR2;                             /*!< System handler priority registers                                     */
  __IO uint32_t  SHPR3;                             /*!< System handler priority registers                                     */
  __IO uint32_t  SHCRS;                             /*!< System handler control and state register                             */
  __IO uint32_t  CFSR_UFSR_BFSR_MMFSR;              /*!< Configurable fault status register                                    */
  __IO uint32_t  HFSR;                              /*!< Hard fault status register                                            */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  MMFAR;                             /*!< Memory management fault address register                              */
  __IO uint32_t  BFAR;                              /*!< Bus fault address register                                            */
  __IO uint32_t  AFSR;                              /*!< Auxiliary fault status register                                       */
} SCB_Type;


/* ================================================================================ */
/* ================                    NVIC_STIR                   ================ */
/* ================================================================================ */


/**
  * @brief Nested vectored interrupt controller (NVIC_STIR)
  */

typedef struct {                                    /*!< NVIC_STIR Structure                                                   */
  __IO uint32_t  STIR;                              /*!< Software trigger interrupt register                                   */
} NVIC_STIR_Type;


/* ================================================================================ */
/* ================                    FPU_CPACR                   ================ */
/* ================================================================================ */


/**
  * @brief Floating point unit CPACR (FPU_CPACR)
  */

typedef struct {                                    /*!< FPU_CPACR Structure                                                   */
  __IO uint32_t  CPACR;                             /*!< Coprocessor access control register                                   */
} FPU_CPACR_Type;


/* ================================================================================ */
/* ================                    SCB_ACTRL                   ================ */
/* ================================================================================ */


/**
  * @brief System control block ACTLR (SCB_ACTRL)
  */

typedef struct {                                    /*!< SCB_ACTRL Structure                                                   */
  __IO uint32_t  ACTRL;                             /*!< Auxiliary control register                                            */
} SCB_ACTRL_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif




/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define GPIOA_BASE                      0x48000000UL
#define GPIOB_BASE                      0x48000400UL
#define GPIOC_BASE                      0x48000800UL
#define GPIOD_BASE                      0x48000C00UL
#define GPIOF_BASE                      0x48001400UL
#define TSC_BASE                        0x40024000UL
#define CRC_BASE                        0x40023000UL
#define Flash_BASE                      0x40022000UL
#define RCC_BASE                        0x40021000UL
#define DMA1_BASE                       0x40020000UL
#define TIM2_BASE                       0x40000000UL
#define TIM15_BASE                      0x40014000UL
#define TIM16_BASE                      0x40014400UL
#define TIM17_BASE                      0x40014800UL
#define USART1_BASE                     0x40013800UL
#define USART2_BASE                     0x40004400UL
#define USART3_BASE                     0x40004800UL
#define SPI2_BASE                       0x40003800UL
#define I2S2ext_BASE                    0x40003400UL
#define I2S3ext_BASE                    0x40004000UL
#define SPI3_BASE                       0x40003C00UL
#define SPI1_BASE                       0x40013000UL
#define EXTI_BASE                       0x40010400UL
#define PWR_BASE                        0x40007000UL
#define I2C1_BASE                       0x40005400UL
#define I2C2_BASE                       0x40005800UL
#define I2C3_BASE                       0x40007800UL
#define IWDG_BASE                       0x40003000UL
#define WWDG_BASE                       0x40002C00UL
#define RTC_BASE                        0x40002800UL
#define TIM6_BASE                       0x40001000UL
#define TIM7_BASE                       0x40001400UL
#define DAC1_BASE                       0x40007400UL
#define DAC2_BASE                       0x40009800UL
#define DBGMCU_BASE                     0xE0042000UL
#define TIM1_BASE                       0x40012C00UL
#define ADC1_BASE                       0x50000000UL
#define ADC2_BASE                       0x50000100UL
#define SYSCFG_COMP_OPAMP_BASE          0x40010000UL
#define TIM3_BASE                       0x40000400UL
#define CAN_BASE                        0x40006400UL
#define ADC_Common_BASE                 0x50000300UL
#define HRTIM_Master_BASE               0x40017400UL
#define HRTIM_TIMA_BASE                 0x40017480UL
#define HRTIM_TIMB_BASE                 0x40017500UL
#define HRTIM_TIMC_BASE                 0x40017580UL
#define HRTIM_TIMD_BASE                 0x40017600UL
#define HRTIM_TIME_BASE                 0x40017680UL
#define HRTIM_Common_BASE               0x40017780UL
#define NVIC_BASE                       0xE000E100UL
#define FPU_BASE                        0xE000EF34UL
#define MPU_BASE                        0xE000ED90UL
#define STK_BASE                        0xE000E010UL
#define SCB_BASE                        0xE000ED00UL
#define NVIC_STIR_BASE                  0xE000EF00UL
#define FPU_CPACR_BASE                  0xE000ED88UL
#define SCB_ACTRL_BASE                  0xE000E008UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define GPIOA                           ((GPIOA_Type              *) GPIOA_BASE)
#define GPIOB                           ((GPIOB_Type              *) GPIOB_BASE)
#define GPIOC                           ((GPIOC_Type              *) GPIOC_BASE)
#define GPIOD                           ((GPIOC_Type              *) GPIOD_BASE)
#define GPIOF                           ((GPIOC_Type              *) GPIOF_BASE)
#define TSC                             ((TSC_Type                *) TSC_BASE)
#define CRC                             ((CRC_Type                *) CRC_BASE)
#define Flash                           ((Flash_Type              *) Flash_BASE)
#define RCC                             ((RCC_Type                *) RCC_BASE)
#define DMA1                            ((DMA1_Type               *) DMA1_BASE)
#define TIM2                            ((TIM2_Type               *) TIM2_BASE)
#define TIM15                           ((TIM15_Type              *) TIM15_BASE)
#define TIM16                           ((TIM16_Type              *) TIM16_BASE)
#define TIM17                           ((TIM17_Type              *) TIM17_BASE)
#define USART1                          ((USART1_Type             *) USART1_BASE)
#define USART2                          ((USART1_Type             *) USART2_BASE)
#define USART3                          ((USART1_Type             *) USART3_BASE)
#define SPI2                            ((SPI2_Type               *) SPI2_BASE)
#define I2S2ext                         ((SPI2_Type               *) I2S2ext_BASE)
#define I2S3ext                         ((SPI2_Type               *) I2S3ext_BASE)
#define SPI3                            ((SPI3_Type               *) SPI3_BASE)
#define SPI1                            ((SPI3_Type               *) SPI1_BASE)
#define EXTI                            ((EXTI_Type               *) EXTI_BASE)
#define PWR                             ((PWR_Type                *) PWR_BASE)
#define I2C1                            ((I2C1_Type               *) I2C1_BASE)
#define I2C2                            ((I2C1_Type               *) I2C2_BASE)
#define I2C3                            ((I2C1_Type               *) I2C3_BASE)
#define IWDG                            ((IWDG_Type               *) IWDG_BASE)
#define WWDG                            ((WWDG_Type               *) WWDG_BASE)
#define RTC                             ((RTC_Type                *) RTC_BASE)
#define TIM6                            ((TIM6_Type               *) TIM6_BASE)
#define TIM7                            ((TIM6_Type               *) TIM7_BASE)
#define DAC1                            ((DAC1_Type               *) DAC1_BASE)
#define DAC2                            ((DAC1_Type               *) DAC2_BASE)
#define DBGMCU                          ((DBGMCU_Type             *) DBGMCU_BASE)
#define TIM1                            ((TIM1_Type               *) TIM1_BASE)
#define ADC1                            ((ADC1_Type               *) ADC1_BASE)
#define ADC2                            ((ADC1_Type               *) ADC2_BASE)
#define SYSCFG_COMP_OPAMP               ((SYSCFG_COMP_OPAMP_Type  *) SYSCFG_COMP_OPAMP_BASE)
#define TIM3                            ((TIM3_Type               *) TIM3_BASE)
#define CAN                             ((CAN_Type                *) CAN_BASE)
#define ADC_Common                      ((ADC_Common_Type         *) ADC_Common_BASE)
#define HRTIM_Master                    ((HRTIM_Master_Type       *) HRTIM_Master_BASE)
#define HRTIM_TIMA                      ((HRTIM_TIMA_Type         *) HRTIM_TIMA_BASE)
#define HRTIM_TIMB                      ((HRTIM_TIMB_Type         *) HRTIM_TIMB_BASE)
#define HRTIM_TIMC                      ((HRTIM_TIMC_Type         *) HRTIM_TIMC_BASE)
#define HRTIM_TIMD                      ((HRTIM_TIMD_Type         *) HRTIM_TIMD_BASE)
#define HRTIM_TIME                      ((HRTIM_TIME_Type         *) HRTIM_TIME_BASE)
#define HRTIM_Common                    ((HRTIM_Common_Type       *) HRTIM_Common_BASE)
#define NVIC                            ((NVIC_Type               *) NVIC_BASE)
#define FPU                             ((FPU_Type                *) FPU_BASE)
#define MPU                             ((MPU_Type                *) MPU_BASE)
#define STK                             ((STK_Type                *) STK_BASE)
#define SCB                             ((SCB_Type                *) SCB_BASE)
#define NVIC_STIR                       ((NVIC_STIR_Type          *) NVIC_STIR_BASE)
#define FPU_CPACR                       ((FPU_CPACR_Type          *) FPU_CPACR_BASE)
#define SCB_ACTRL                       ((SCB_ACTRL_Type          *) SCB_ACTRL_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group STM32F3x4 */
/** @} */ /* End of group (null) */

#ifdef __cplusplus
}
#endif


#endif  /* STM32F3x4_H */

